[
  {
    "url": "https://gradireland.com/jobs/finance-administrator-171566",
    "description": "Graduate job\nWe are seeking an experienced and detail-oriented individual for the position\nof Hotel Finance\nAdministrator\nat The Athlone Springs Hotel.\nLocation:\nThis is an inhouse role based at The Athlone Springs Hotel .\nPurpose of the Role:\nThe four-star Athlone Springs Hotel Hotel in Athlone is a member of the Só Hotel group, comprising of 68 guest bedrooms. Additional outlets include the Cedar Bar and Restaurant, extensive Conference and Banqueting facilities and Zen Leisure Club.\nWe are recruiting for a person to join our accounting department to provide strong financial accounting skills and business knowledge to the management team and to be a vital member of the accounting administration function of the Group.\nMain Duties:\nThe role is responsible for providing effective operational financial and commercial support to the management team thus enabling better management and business controls. Specific duties include:\nDaily Revenue Reporting & Cash Balancing\nWeekly KPI Reporting\nUpdating Alkimii T&A with actual and forecast data\nMaintaining Procure Wizard and processing all Invoices & Credits\nProvision of data for Monthly Stock-takes & participation in review\nCreditors Reconciliations & Payment Processing\nAccounts Receivable Collection & Guest Ledger Controls\nLeisure Centre Membership & Class Allocations\nOverhead Analysis and Review\nData entry to Trial Balance Standard\nCapital Expenditure Controls\nProvide ad hoc reports to Management & Group as required\nThe Ideal Person:\nThe ideal Person would be a self-motivated, with a deep understanding of the hospitality industry. Knowledge of Hotsoft would be an advantage.\nYour Skills:\nPart Qualified/Qualified Accountant / Accounting technician or Finance Graduate\nStrong communication and influencing skills\nGood Team Player – Interested in providing accurate and timely information and willingness to work with HOD’s to understand all operational areas of the business\nHigh standard of accuracy and attention to detail\nExcellent skills in relation to MS Office particularly Excel\nAbility to work on own initiative and also as part of a team to motivate and enhance best practices at all times\nBenefits\nThe Só Hotel Group is an awarding company to work for. We are very proud of our team and value their commitment to creating positive experiences for our guests and colleagues alike.\nIn return, we offer an exciting, vibrant, positive and rewarding working environment. Some benefits employees of Só Hotels enjoy are as follows:\nThe provision of ongoing training and development opportunities\nEmployee Recognition Awards\nFree car parking\nCareer enhancement/progression opportunities\nGroup Employee Discount Scheme\nFree Meals on duty\nComplimentary use of The Leisure Club\nComplimentary Coffee\nHealthcare scheme\nEmployee Assistance Program\nRelocation assistance\nBoost your chances of success!\nA checklist to help you land your ideal graduate role.\nMore Details\nApply by\n30.04.2025\nApply by email\nSave\nShare\nReport job",
    "label": 1
  },
  {
    "url": "https://gradireland.com/jobs/internship-uk-94733",
    "description": "Graduate job\nJob description\nWant to spend the summer getting ahead, need academic credit as part of your degree, or wondering what’s next after graduation? Get hands-on work experience, globalise your CV and put your career on the map with a professional internship in the UK.\nJENZA can sponsor students or recent grads of all nationalities to intern in the UK for 1-12 months. Backed by 60+ years of work and intern abroad expertise, our dedicated UK-based team provide the sponsorship paperwork, step-by-step visa advice, placement support, employer vetting, and in-country check-ins to live and intern in the UK. Read on...\nThe placement bit:\nIn a competitive job market, an international internship can be the thing that makes your resume stand out. But getting a foot in the door can be hard. If you already have an internship through your university or own contacts – we can act as your visa sponsors. We’ve sponsored past students to intern at Manchester Utd, Christies, The British Museum, House of Commons, Victoria & Albert Museum, and more\nIf you don’t have your placement, choose our ‘Placement Support’ option and tap into our network of pre-qualified UK employers. On our online Job Hub you’ll find both paid and voluntary internships - in fields including Marketing, Finance, Business, Fashion, Architecture, Artist Management, PR and more.\nThe money bit:\nWe can sponsor you to do a paid or voluntary internship. Salaries vary between placements, but they must meet at least the minimum wage requirements for the UK. The cost of living in the UK, especially in London, might be higher than in your home country. While we don’t offer accommodation, we work with some great people who do. When you book, we’ll give you all the intel you need on how to find a place to live.\nThe visa bit:\nTo intern in the UK, you need to be eligible for a Temporary Work GAE (Government Authorised Exchange) visa. This allows international students and recent grads of all nationalities to come to the UK for 1-12 months to complete short-term work experience. To be eligible for this visa, you must be 18+ and either a full-time degree level student or a recent graduate who will start their UK internship within 24 months of the date on your graduation certificate. Our sibling brand in the UK is one of the largest A-rated sponsors for this program and we’ve sponsored thousands of students and grads to make their mark in the UK. For the full eligibility requirements, visit jenza.com or give our JENZA Support Squad a call for all the info and intel.\nOur team is all about showcasing authentic adventures of working and travelling abroad. This means that we're always on the lookout for brand ambassadors, collaborators, and content creators - so reach out to our team if you're on board with sharing about a past working holiday or documenting your work abroad experience in the future!\nBoost your chances of success!\nA checklist to help you land your ideal graduate role.\nMore Details\nApply by\n30.04.2025\nApply by email\nSave\nEmployer info\nShare\nReport job",
    "label": 1
  },
  {
    "url": "https://gradireland.com/jobs/events-social-media-executive-173666",
    "description": "Graduate job\nJob Title: Events & Social Media Executive\nJob Location:\nConnemara Coast Hotel\nJob Type:\nFull-Time, Tuesday to Saturday\nDepartment:\nSales and Marketing\nJob Summary:\nWe are seeking a motivated and dynamic Sales and Event Coordinator to join our team. This role will focus on handling incoming sales enquiries, assisting with event coordination, especially weddings, maintaining and planning social media presence, and updating databases to ensure smooth operations. The ideal candidate will possess excellent communication skills, have an eye for detail and demonstrate the ability to effectively work with teams and clients. Familiarity with certain software tools is preferred, but training will be provided where needed.\nKey Responsibilities:\n1. Incoming Sales Ability:\nRespond promptly to hotel enquiries via phone, email, and face-to-face interactions.\nPresent and communicate detailed information about hotel services, packages, and event offerings.\nConvert enquiries into bookings through professional and persuasive communication.\n2. Meetings & Events Coordination:\nAssist with the planning, coordination, and execution of meetings and events, with a strong focus on weddings.\nProvide operational support, including liaising with clients and suppliers, ensuring every detail is attended to.\nOversee event timelines and logistics, ensuring smooth execution and customer satisfaction.\n3. Social Media Administration & Coordination:\nCollaborate with the Sales & Marketing team to plan and execute social media strategies.\nOwn and manage the hotel's social media accounts, posting regular content across chosen platforms.\nTrack and report on social media performance and adjust strategies accordingly.\n4. Review Platform Management and Database Housekeeping:\nUsing the hotel review platform, the successful candidate will respond to positive and negative reviews and compile information to disseminate to HOD’s for constructive feedback.\nUpdate and maintain the customer relationship management (CRM) systems and Property Management System (PMS) with accurate contact information for companies and organizations.\nEnsure database is current, organized, and fully functional for sales and event enquiries.\n5. Computer Skills:\nProficient in Microsoft Office Suite (Word, Excel, PowerPoint, Outlook) for daily administrative tasks.\nCompetency in Canva for creating event or marketing-related content.\nFamiliarity with Moposa or similar event management software is an advantage, but not mandatory.\n6. PMS Experience:\nExperience with Property Management Systems (PMS) is a plus, but training can be provided.\nCreate and maintain function sheets 4 weeks in advance, ensuring all event details are accurately recorded and communicated to relevant teams.\n7. Weekly Roster:\nFlexibility to work according to business needs including some weekends for events, if and where needed. This is a full-time role, 5 days a week.\nQualifications and Skills:\nStrong communication skills, both written and verbal, with the ability to build rapport and engage clients effectively.\nExcellent organizational skills and attention to detail, particularly when coordinating events.\nPrior experience in meetings, events, and weddings is highly desirable.\nSocial media management experience and a creative flair for content creation.\nAbility to work in a fast-paced environment and handle multiple tasks simultaneously.\nStrong computer literacy, with experience in Microsoft Office and Canva (Moposa and PMS experience is a plus).\nPrevious experience in sales or customer service is a benefit.\nTeam player with the ability to collaborate effectively with different departments.\nAdditional Information:\nThis role may require occasional weekend and evening work depending on event schedules.\nTraining and support will be provided for specific software tools and systems.\nIf you're a proactive and detail-oriented individual with a passion for sales, events, and customer service, we would love to hear from you!\nBoost your chances of success!\nA checklist to help you land your ideal graduate role.\nMore Details\nApply by\n30.04.2025\nApply by email\nSave\nShare\nReport job",
    "label": 1
  },
  {
    "url": "https://gradireland.com/jobs/technical-analyst-173522",
    "description": "Graduate job\nTechnical Analyst – Jackson Square Aviation\nBackground\nThe successful candidate will have a strong interest in aviation, be self-motivated and team orientated and have a desire to succeed.\nJSA encourages continuous professional development and prides itself on employee coaching and mentoring. The successful candidate will be granted the opportunity to learn and develop technical and aviation leasing skills working alongside professionals and experts in their field.\nKey Responsibilities & Duties Include\nAnalysing, modelling, and pricing aircraft transactions.\nAssist the technical staff in managing MR claims through the review and approval process.\nSupporting technical and marketing personnel as required\nAssist the procurement team on various projects.\nAssist the engineering team in reviewing aircraft specifications, identifying modifications, engaging with vendors, and ensuring on-time delivery.\nPerform regular maintenance fly forward reports in coordination with wider cross-department teams.\nManage CMS system and document management, help maintain current specs of all assets.\nWill be expected to proactively participate in committees, projects and special events that support the JSA culture\nKnowledge, Skills, and Experience\nRequired Experience\nAeronautical or Engineering degree\nOr up to 5 years of technical experience within an MRO, OEM, airline, Part 21 company or maintenance service provider.\nDemonstratable strong analytical skills.\nKnowledge of aircraft/engine technical records and legal requirements.\nWorking knowledge of Microsoft Office Suite\nPreferred Additional Experience\nHighly competent user of Microsoft Excel.\nOther information\nThe opportunity for international travel will be provided on an ad-hoc basis.\nBoost your chances of success!\nA checklist to help you land your ideal graduate role.\nMore Details\nApply by\n30.04.2025\nApply by email\nSave\nShare\nReport job",
    "label": 1
  },
  {
    "url": "https://gradireland.com/jobs/business-development-graduate-summer-2025-143754",
    "description": "Graduate job\nAre you a motivated graduate looking to develop your career in sales? Then the Business Development Graduate role at KEYENCE will be a great fit for you!\nAbout the role:\nAs a Business Development Graduate, you will be empowered to be the CEO of your territory and manage your own clients.\nNo two days will be the same as a Business Development Graduate at KEYENCE. 3 days a week will be field based, which will involve driving to client sites, demonstrating our products and selling them directly to customers. The other 2 days will be spent collaborating with your team in the office, calling customers to find new business opportunities and nurture already existing relationships.\nYour journey with KEYENCE will start with our comprehensive in-house training programme which incorporates classroom-style learning and on the job training with experienced sales mentors. This will provide you with a strong technical understanding of our products and will help you develop the commercial mindset to sell our products to clients.\nTraining and development never stop at KEYENCE. We offer continuous training so you can keep improving your skills, such as sales skill training, leadership training, and management training. We offer continuous opportunities for you to keep improving your skills, such as sales skill training and leadership training. And our 100% promote-from-within policy means that today’s graduates are the managers of tomorrow!\nBenefits\nStarting Salary - €37,300+ Location Allowance of €2350\nQuarterly Bonus (Guaranteed minimum bonus year 1 = €5,700)\nCompany Car for Business and Personal Use\nAdvanced Company Pension with Zurich\nContribution towards Private Healthcare\nFull Expensed Business Travel and Accommodation\nLaptop and Mobile Phone\nPersonal Requirements\nDegree-educated in any discipline\nWinning mentality\nMust be eligible to work in Ireland by the time the role commences.\nMust have a full driving licence, valid in Ireland\nAbout KEYENCE\nKEYENCE is a world leader in Sensors, Safety, Vision, Measurement and Microscopes. Founded in 1974, KEYENCE has experienced rapid growth, now turning over more than $8 billion global sales per year and working across 90% of all industries.\nOur unique Direct Sales model makes us stand out from competitors and allows us to operate on over 50% profit!\nBoost your chances of success!\nA checklist to help you land your ideal graduate role.\nMore Details\nApply by\n30.04.2025\nLocations\nDublin, Ireland\nApply\nSave\nEmployer info\nShare\nReport job",
    "label": 1
  },
  {
    "url": "https://gradireland.com/jobs/networks-cyber-security-ict-specialist-173738",
    "description": "Graduate job\n•\n€35,000 - €39,999\nNetworks & Cyber Security ICT Specialist at Executive Officer level in the Civil Service\nThe Civil Service employs over 49,000 people nationwide across the 18 Government Departments and more than 20 other Civil Service offices and agencies. Our vision is inclusive, high quality and integrated service provision that meets the needs and improves the lives of the people of Ireland.\nThe Networks and Cyber Security - ICT Specialists recruited from this competition will be directly involved in delivering on a range of Government strategies within their appointed organisations. This is an exciting opportunity to be part of a larger team delivering on the ambitions of Ireland to be a digital leader and enabling digital engagement with the State by businesses, members of the public and public servants.\nSuccessful candidates will be integral members of teams that are delivering the network and cyber-related infrastructures and services supporting colleagues in their organisations and, in many cases, services used by members of the public. They can also be involved with critical projects of national importance and public prominence such as systems for the Revenue Commissioners, social welfare supports, the agri-food sector, the census and key life events such as driving licences and employment permits.\nThe panel formed from this competition will be used to fill vacancies across the Civil Service. Applicants should note that the majority of vacancies will be in the greater Dublin area.\nFull details of the roles, including specific eligibility requirements, is available on\nwww.publicjobs.ie\nThe closing date for receipt of completed applications is 3pm on Thursday, 1st May 2025.\nWe are committed to a policy of equal opportunity and encourage applications under all nine grounds of the Employment Equality Act.\nBoost your chances of success!\nA checklist to help you land your ideal graduate role.\nMore Details\nSalary\n€35,000 - €39,999\nApply by\n01.05.2025\nLocations\nDublin\nApply\nSave\nEmployer info\nShare\nReport job",
    "label": 1
  },
  {
    "url": "https://gradireland.com/jobs/graduate-electronic-engineer-173018",
    "description": "Graduate job\nJob Specification – Graduate Electronic Engineer\nCerefuze Medical is a start-up medical device company based in Galway, Ireland. The company is developing a transformative treatment in stroke care to treat Reperfusion Injury. Cerefuze innovation will be the world’s first novel game changing device & therapy to assist stroke patients over the short, medium and longer term.\nThe Opportunity\n- A fantastic R&D position, working closely alongside the R&D senior management with ample scope to upskill while also being surrounded by a team of peers driving innovation. Working on breakthrough device design including clinical interactions, device testing and analytical skills.\nResponsibilities:\nWorking with stakeholders to define & document hardware & software requirements\nIdentify suitable electronic components to meet design requirements.\nLiaise with external consultants & service providers to co-ordinate prototyping & production of early-stage concept controllers.\nWrite, test, and refine software to meet design requirements.\nPreparing and reviewing test protocols for design testing.\nProblem solving test failures or product issues.\nPreparing design documentation & drawings.\nDevelop early-stage prototypes for review key stakeholders.\nConduct feasibility studies and technical evaluations of new technologies\nSkills and Requirements\nA qualification in Software Engineering, Computer Science, Electronic Engineering, Mechatronic Engineering or similar.\nTheoretical engineering knowledge in signal theory, analogue and digital electronics, high frequency electronics.\nGood Communicator with a strong work ethics and a team-oriented mindset. Startup experience is a plus.\nBehaviours & Skills required include:\nExcellent presentation and verbal communication skills are essential.\nTechnically competent and confident, and able to engage peer to peer with both R&D engineers and physicians.\nMust be available to travel occasionally.\nPlease contact us at\nInfo@Cerefuze.com\nBoost your chances of success!\nA checklist to help you land your ideal graduate role.\nMore Details\nApply by\n07.05.2025\nApply by email\nSave\nShare\nReport job",
    "label": 1
  },
  {
    "url": "https://gradireland.com/jobs/artificial-intelligence-ai-intern-asia-internships-internship-placement-service-china-173236",
    "description": "Graduate job\nProgram summary\nContinuous recruitment with flexible starting dates\nThis placement requires program fee from applicant, please find details on our website\nwww.asia-internship.com\nOpportunities also in marketing, finance, legal and other fields\nKey Responsibilities:\nAssist in the design, development, and implementation of AI/ML models and algorithms.\nPreprocess and analyze large datasets to extract meaningful insights.\nCollaborate with cross-functional teams to integrate AI solutions into existing systems.\nConduct research on state-of-the-art AI techniques and tools.\nParticipate in model training, validation, and optimization.\nDocument and present findings, progress, and results to the team.\nSupport the deployment of AI models into production environments.\nQualifications:\nCurrently pursuing a degree in Computer Science, Data Science, Artificial Intelligence, or a related field.\nFamiliarity with programming languages such as Python, R, or Java.\nBasic understanding of machine learning frameworks (e.g., TensorFlow, PyTorch, Scikit-learn).\nKnowledge of data preprocessing, visualization, and analysis tools (e.g., Pandas, NumPy, Matplotlib).\nStrong problem-solving skills and a passion for AI/ML technologies.\nExcellent communication and teamwork skills.\nPreferred Skills:\nExperience with natural language processing (NLP), computer vision, or reinforcement learning.\nFamiliarity with cloud platforms (e.g., AWS, Google Cloud, Azure).\nUnderstanding of software development practices and version control (e.g., Git).\nBenefits:\nHands-on experience with real-world AI projects.\nMentorship from experienced engineers\nNetworking opportunities within the company.\nCompletion certificate/Reference letter from the supervisor\nYou will be expected to receive the following services from us:\nPlacement Service - we match you with a placement in your field of interest\nVisa guidance (how to apply an internship visa for China)\nPre-departure handbook (how to prepare your trip, living tips in China and so on)\nFull-time job recommendation (if any of   host companies are offering an full-time job opportunity and you are an ideal candidate we will inform you this opportunity)\nTo Apply\nContact\nhi@asia-internship.com\n(add our email address to your contacts to avoid being marked as a spam) or go to website\nhttps://www.asia-internship.com/onsite-internship-in-china\nto apply\n(We also offer remote internship opportunities please contact us for more details)\nBoost your chances of success!\nA checklist to help you land your ideal graduate role.\nMore Details\nApply by\n07.05.2025\nApply\nSave\nShare\nReport job",
    "label": 1
  },
  {
    "url": "https://gradireland.com/jobs/graduate-sales-business-management-trainee-limerick-173128",
    "description": "Graduate job\nAre you a recent graduate with a passion for business and the drive to succeed? The UK and Ireland’s largest supplier of electrical equipment to business and trade customers is offering an exciting opportunity to join their comprehensive graduate programme designed to cultivate the next generation of sales leaders and managers.\nAbout the Company\nThe company you’ll be joining recognises the importance of nurturing talent and building a strong succession plan. Their graduate sales and business management programme was established over a decade ago to bring in bright and ambitious graduates who are eager to learn about business operations. They seek individuals who are money-motivated and aspire to become effective salespeople and future managers. It’s an exciting time to join the business in Ireland, as they have big plans for expansion and new acquisitions this year.\nGraduate Training Programme: First 6 months\nDevelop a core knowledge of how the business operates – warehouse, logistics, supply chain, administration, IT software, and marketing.\nGet hands-on with the vast product range and learn about different manufacturers and the electrical distribution industry.\nStart building relationships, making deals and advising customers face-to-face over the trade counter e.g. electricians, contractors and tradespeople.\nBegin your formal sales training course and network with other Graduate Trainees from across the company.\nComplete workbook assessments to underpin your learning and development and receive financial incentives for each one passed to a required standard.\n6-12 months\nMove to internal sales account management, engaging with business customers over the phone e.g. construction companies, local government authorities, housing developers and hotels.\nLearn business development strategies and how to target and win new trading accounts.\n12 months and beyond\nProgress to a diverse business-to-business field sales management position, with increased earning potential and bigger bonuses.\nTravel locally in your company car, meeting clients, discussing projects, and arranging social activities.\nWork towards running your own business in the group, learning about staff management, purchasing, profit and loss, etc. The business operates in a decentralised manner, allowing local managers to make informed decisions that drive the business forward.\nApply Today to Find Out More\nIf you’re ready to kick-start your career in a company that values innovation, autonomy, and career development, this is the graduate program for you. We seek graduates who are money-motivated, relationship builders, competitive, and driven. If you have a passion for sales and the ability to build lasting relationships, apply today!\nPlease note, a full driving licence is required for this role.\nBoost your chances of success!\nA checklist to help you land your ideal graduate role.\nMore Details\nApply by\n07.05.2025\nApply\nSave\nShare\nReport job",
    "label": 1
  },
  {
    "url": "https://gradireland.com/jobs/inside-sales-representative-173198",
    "description": "Graduate job\nWho are we?\nAt Bright, we create cutting-edge software for accounting, payroll, tax, and practice management, supported by a team of talented individuals who are passionate about making a difference. Together, we lead the industry with innovative solutions and unparalleled customer support.\nWe’re all about creating opportunities for businesses to succeed—and for you to shine. Join us, and be part of a supportive, collaborative team that values your voice and contributions.\nWhy join us?\nWe believe in empowering people to grow professionally while maintaining balance in their lives. At Bright, you’ll work in a dynamic, inclusive environment that supports your personal and career aspirations.\nOur Products:\nOur award-winning software helps small businesses and accountants across Ireland and the UK manage their payroll, accounts and HR practices. We take the headache out of business management and provide cost effective, real solutions to accountants and business owners.\nThe Role:\nAs an Inside Sales Representative you will play a key role in our driving company growth and success across Ireland and the UK. You will be responsible for initiating and building relationships with prospective new customers. Providing them with a great solution to help manage their business.\nKey Responsibilities:\nContact leads by phone with the objective of booking online software demos\nActively liaise with prospects, fact-finding key data\nAct as the initial point of contact to all new prospects\nMaintain a high level of client service and client relationships, ensuring a premium level of customer satisfaction\nAchieve and exceed targets on a weekly and monthly basis\nKeep up-to-date records through our CRM system\nMaintain a basic understanding of our software's in order to answer prospects questions\nTake and process orders in an accurate manner\nWhat are we looking for?\nA third level qualification, ideally in Sales or Business would be a distinct advantage\nA strong desire to pursue a career in sales, sales experience would be beneficial but not essential\nA positive, can-do attitude.\nStrong communication skills, both verbal and written\nExcellent phone and presentation skills\nAn eager to learn mindset, focused on excelling and developing\nTarget driven\nBoost your chances of success!\nA checklist to help you land your ideal graduate role.\nMore Details\nApply by\n07.05.2025\nApply\nSave\nShare\nReport job",
    "label": 1
  },
  {
    "url": "https://gradireland.com/jobs/fitness-instructor-leisure-club-assistant-172276",
    "description": "Graduate job\nThe objective of the Role\nWorking with the team in delivering excellent guest care, the successful candidate will be required to:\nEnsure a professional, friendly, and courteous service to all guests;\nTo ensure that guests are warmly welcomed and that orders are taken efficiently;\nAssist in swim lessons;\nTo always be familiar with membership offerings; Sell/Upsell membership\nTo clean and maintain all areas of the Health Club\nFlexible shifts pattern morning/evening\nExcellent Guest Care and Service;\nEnsure that the fitness and leisure facilities are safe at all times.\nProvide help and guidance to members and guests.\nRequirements:\nThe ideal candidate will have:\nQualified First Aider;\nA nationally recognised NCEHS/NCEF Fitness Instructors qualification or equivalent desirable\nIWS/ILAM Pool Lifeguard or equivalent qualification advantageous\nAssistant Swim Teachers advantageous;\nExcellent Guest Care and Service;\nIncludes evening and weekend work;\nB\nenefits include:\nMeals on duty;\nProfessional training and development opportunities*;\nComplimentary Centre Membership*;\nDiscounted treatments at Serenity Spa\nT&C’s Apply\nWork remotely\nNo\nJob Type: Part-time\nBoost your chances of success!\nA checklist to help you land your ideal graduate role.\nMore Details\nApply by\n07.05.2025\nApply by email\nSave\nShare\nReport job",
    "label": 1
  },
  {
    "url": "https://gradireland.com/jobs/junior-service-and-calibration-engineer-173052",
    "description": "Graduate job\nJob Description:\nWe are seeking a motivated graduate to join our team as a Junior Calibration Technician. This role involves performing routine and specialized calibrations on various equipment, including electrical, mechanical, temperature, pressure systems and more, ensuring compliance with industry standards and regulatory requirements.\nKey Responsibilities:\nConduct scheduled calibrations of instruments and equipment.\nMaintain accurate documentation of calibration activities.\nCollaborate with operational teams to facilitate calibration processes.\nPerform troubleshooting and basic repairs on measurement devices.\nQualifications:\nRecent graduate in Engineering, Physics, or a related technical field.\nStrong trouble shooting skills and attention to detail.\nAbility to work independently and as part of a team.\nPreferred Skills:\nFamiliarity with calibration procedures and standards.\nBasic knowledge of mechanical or electrical systems.\nBenefits:\nCompetitive salary.\nOpportunities for professional development and training.\nSupportive work environment with career growth potential.\nBoost your chances of success!\nA checklist to help you land your ideal graduate role.\nMore Details\nApply by\n07.05.2025\nApply by email\nSave\nShare\nReport job",
    "label": 1
  },
  {
    "url": "https://gradireland.com/jobs/trainee-auditor-2025-173740",
    "description": "Graduate job\n•\n€41,208\nThe Office of the Comptroller and Auditor General (the Office) seeks to hire Trainee Auditors to join our team. We are looking for graduates who want to pursue a course of professional studies leading to a qualification with one of the recognised accountancy bodies within the Public Sector.\nHaving been certified for the 4th consecutive year as a ‘Great Place to Work’ and also recognised on the 2025 list of Ireland’s Best Workplaces™, the Office is the perfect place to advance your career in a challenging and fast paced environment.\nWorking for the Office will give you the opportunity to:\nBecome a professional accountant (or continue your development if already qualified)\nEngage with a wide range of stakeholders, including public bodies and other audit institutions\nLearn and develop skills for a career in audit, accountancy and the public service\nWork of the Office\nThe Office assists the Comptroller and Auditor General to:\naudit and report on the accounts of public bodies\nestablish that transactions of public bodies are in accordance with the legal authorities governing them and that funds are applied for the purposes intended\nexamine whether State bodies are using their resources economically and efficiently and have mechanisms in place to evaluate the effectiveness of their operations\nauthorise the release of funds from the Exchequer for purposes permitted by law\nThe position of Trainee Auditor involves:\nworking as part of audit teams which carry out the audits of annual financial statements of public bodies such as government departments/offices and State-sponsored, health and educational bodies\nreviewing the internal control systems in place in these audited bodies\nparticipating in project audits of significant programmes or areas of expenditure\nparticipating in performance measurement reviews in the Office’s Performance Audit Directorate\nparticipating in inspections of other publicly funded organisations.\nOther information:\nStarting salary of €41,208\nFunding and study leave for professional accountancy exams.\nFlexible working hours\nAccess to hybrid working (up to 60% at home) following an onsite induction period\nPension entitlements\nExcellent career development including opportunities for promotion once qualified.\nA structured learning and development environment to develop key skills and competencies.\nWorking for the Office will give you the opportunity to:\nBecome a professional accountant (or continue your development if already qualified)\nEngage with a wide range of stakeholders, including public bodies and other audit institutions.\nLearn and develop skills for a career in audit, accountancy and the public service.\nApplicants for these positions must, on or before the 31st October 2025:\n(i) be a qualified accountant with full membership of a prescribed accountancy body supervised by the Irish Auditing and Accounting Supervisory Authority (IAASA) (ACCA, AIA, CAI, CIMA, CIPFA)\nOR\n(ii) hold a primary honours degree at minimum 2.1 (at least Level 8 on the National Framework of Qualifications) in any discipline\nOR\n(iii) have sat and passed at least the first level of recognised professional accountancy examinations in an accountancy body regulated by the Irish Auditing and Accounting Supervisory Authority (IAASA)\nOR\n(iv) have Accounting Technicians Ireland membership\nFor further details and how to apply, please see the Information booklet.\nClosing Date: 3pm on Thursday 8th May 2025\nWe are committed to a policy of equal opportunity and encourage applications under all nine grounds of the Employment Equality Act.\nBoost your chances of success!\nA checklist to help you land your ideal graduate role.\nMore Details\nSalary\n€41,208\nApply by\n08.05.2025\nLocations\nDublin\nApply\nSave\nEmployer info\nShare\nReport job",
    "label": 1
  },
  {
    "url": "https://gradireland.com/jobs/graduate-boarding-assistant-173488",
    "description": "Graduate job\nOur Mission\nClongowes Wood College was founded in 1814 and is one of Ireland’s oldest and most successful 7-day boarding schools with an enrolment of c.450. We continue today under the College’s motto: aeterna non caduca, striving for the lasting (eternal) values and not the ephemeral.\nWe are committed to the provision of the highest quality Catholic education in the Jesuit tradition. Our mission is to educate students according to the highest standards of Jesuit schooling and the values of the Gospel as expressed in The Characteristics of Jesuit Education and the more recent A Living Tradition in the 21st Century. It is our fidelity to Clongowes’ Jesuit mission and Christian teaching that stand us in good stead in the demanding times we live in and the challenges which lie ahead.\nLiving together in a boarding school gives the opportunity to develop a real sense of family and to fulfil one of the aims of Jesuit education to become a person for others. The school strives to ensure that cura personalis, the importance of looking after and caring for the individual, is a guiding element in everything that we do. We are dedicated to forming young leaders whose core will be the mission of the Gospel: reconciliation with justice and compassionate care for all creation.\nThe Role\nThe position will suit a graduate student who is considering a future in education or has a passion for sport. The role of the Graduate Boarding Assistant is to assist the Prefecting team in all aspects of their duties. Prefects in Clongowes are Housemasters in loco parentis to students. Typical duties will include:\nHelp establish a home-like, family atmosphere embodying the College’s Jesuit values, and facilitate possibilities for the boys to grow in their faith.\nSupervising and leading students through their day to day routines.\nExtracurricular activities, in particular sport, play an important part of life in Clongowes. The Prefecting team are heavily involved in helping to coach and train teams. Similarly, graduate boarding assistants are also expected to facilitate boys in their extracurricular and sporting interests.\nAssist the Prefecting team with practical tasks in the dormitory and around the College.\nDuties include two overnight shifts per week. While on duty, Graduate Boarding Assistants reside in the college.\nFrom time-to-time, the job description may be reviewed to reflect or anticipate changes in the College’s requirements, and if it is necessary to adjust this, those involved will be consulted.\nRequirements\nAn interest in working with young people, ideally within a teaching or coaching capacity.\nDemonstrate a high level of maturity with the ability to build strong relationships with boys, parents\nor colleagues.\nSupportive of our Jesuit ethos.\nCollaborative and flexible approach & comfortable working as part of a team.\nNaturally possess a positive mind-set.\nConfident and persuasive written and verbal communicator.\nAble to represent the College well in public.\nCalm under pressure; employ tact and diplomacy in difficult or sensitive situations.\nHave a commitment to safeguarding and the welfare of young people.\nDemonstrate a high level of emotional intelligence.\nA good sense of humour and a sense of proportion.\nDrivers Licence\nBenefits\nExtensive Sports Facilities including gym and pool\n9 hole golf course\nAccommodation provided on campus\nTerms of employment\nTerm\n: The post is fixed term from late August 2025 to the end of June 2026.\nResidency requirement:\nSuccessful candidates must be entitled to work and reside in Ireland.\nAccommodation:\nSingle accommodation onsite is available.\nSalary:\nBy negotiation with the Headmaster. The notice period will be one term, following an initial probationary period.\nSafeguarding\nThe interview process will explore issues relating to safeguarding and promoting the welfare of children. The appointment will be subject to the satisfactory outcome of Garda Vetting.\nApplication Process\nExpressions of interest for this role should be made to sgray@clongowes.net as soon as possible but no later than Thursday 9th May. Applicants should submit a curriculum vitae and completed\napplication form.\nPlease note that references will not be accepted from relatives or from people writing solely in the capacity of friends. One referee should be the applicant’s current or most recent employer. The College will seek references from short-listed candidates and may approach previous employers for information to verify experience or qualifications. Where an applicant is currently working with children, the current employer will be asked about disciplinary offences relating to children and whether the applicant has been the subject of any child protection concerns and if so, the outcome of any enquiry or disciplinary procedure. Where an applicant is not currently working with children but has done so in the past, that previous employer will be asked about those issues.\nBoost your chances of success!\nA checklist to help you land your ideal graduate role.\nMore Details\nApply by\n09.05.2025\nApply by email\nSave\nShare\nReport job",
    "label": 1
  },
  {
    "url": "https://gradireland.com/jobs/inside-sales-representative-173534",
    "description": "Graduate job\nWho are we?​\nAt Bright, we've engineered cutting-edge software for accounting, payroll, tax, and practice management. We've assembled a team of top talent and stand ready to lead the industry with our superior software solutions and unparalleled customer support.\nWe're brilliant people creating brilliant software! Join us in our mission to create brilliant software that empowers businesses to reach new heights.\nThe Opportunity\nAs an Inside Sales Representative you will play a key role in our driving company growth and success across Ireland and the UK. You will be responsible for initiating and building relationships with prospective new customers. Providing them with a great solution to help manage their business.\nThe Person\nThis role would suit an individual with an excellent work ethic who is looking to develop a successful career in sales. The ideal candidate will have:\nA third level qualification, ideally in Sales or Business would be a distinct advantage\nA strong desire to pursue a career in sales, sales experience would be beneficial but not essential\nA positive, can-do attitude.\nStrong communication skills, both verbal and written\nExcellent phone and presentation skills\nAn eager to learn mindset, focused on excelling and developing\nTarget driven\nMore on the role\nContact leads by phone with the objective of booking online software demos\nActively liaise with prospects, fact-finding key data\nAct as the initial point of contact to all new prospects\nMaintain a high level of client service and client relationships, ensuring a premium level of customer satisfaction\nAchieve and exceed targets on a weekly and monthly basis\nKeep up-to-date records through our CRM system\nMaintain a basic understanding of our software's in order to answer prospects questions\nOur Benefits include\nCompetitive starting salary and commission structure\n25 days annual leave\nCompany pension\nHealth Insurance\nHybrid working opportunities\nOn-site parking\nFree Food & Friday Fry\nEducational Assistance\nGreat company social events\nWellness programmes\nBike to Work\nBoost your chances of success!\nA checklist to help you land your ideal graduate role.\nMore Details\nApply by\n09.05.2025\nApply\nSave\nShare\nReport job",
    "label": 1
  },
  {
    "url": "https://gradireland.com/jobs/programme-executive-173582",
    "description": "Graduate job\nEvent Partners is a multi-award-winning leader and principal player in the Events, Meetings, Incentive Travel and Destination Management industry. Our excellence is best illustrated in the impressive portfolio of outstanding projects we have delivered on behalf of national and world-renowned organisations, companies and institutions from across the globe.\nWe believe our people are central to our success, professionalism, and character.\nAs a company, we place great importance on creativity, teamwork and forging lasting relationships. As a result of proactively securing a large amount of business for Ireland in the coming years, we are expanding and growing our company, and the following position is available.\nThe successful candidate will have the opportunity to work within a dynamic, fast-paced operations team, allowing you to contribute and grow. The team you will join is passionate about events and unafraid to push boundaries. We aim to ‘Think Differently’ every day, and nothing gives us more pleasure than beating our competition fairly and professionally.\nIf you think you are a game changer who can be responsible for delighted clients, then you might be the perfect person for our team.\nOur Core Values:\nPeople: We are a team of experienced and passionate people who care\nInnovation: Our creative genius sets us and you apart\nPartnership: Relationships and trust are important to us\nOur Brand Promises:\nA comfortable environment of financial and reputational security\nGlobal credibility & visibility\nAn intimate & inspiring environment for learning\nWe believe that our people are central to our success. We place great importance on teamwork and forging lasting relationships as a company. As a result of proactively securing a large amount of business for Ireland in the coming years, we are expanding and growing our company, and the following position is available.\nSuccessful candidates will join a highly creative, passionate, and results-driven team. Strong interpersonal skills and exceptional support skills are essential to creating the right environment for the team to succeed. To excel in this role, you will enjoy working in a fast-paced team environment, have excellent people skills, and be comfortable managing conflicting priorities and tight deadlines.\nThis is a Programme Executive Role within the operations team of Event Partners. This role is hands-on and involves working as part of the Operations team. The successful person must be able to complete a wide range of activities requiring clear communication, excellent organisational skills and attention to detail. The Programme Executive will manage large and repeat client accounts with complex programs and significant budgets. They must work exceptionally under pressure, ensuring every event's smooth and efficient running from the initial handover to the final invoice. This candidate will manage approximately 8-10 events/projects a year and join several site inspections to assist with the procurement of future business.\nTypes of projects to include but not limited to:\nIncentive Programs\nCorporate Meetings and Conferences\nAward Ceremonies\nPromotions and Product Launches\nSite Inspections\nFamiliarization Trips\nWe look for candidates who are:\nAmbitious; competitive, self-driven, self-motivated, goal-oriented, and confident\nPassionate; passionate about the work you do and that excites and inspires others\nPoised; able to thrive under pressure and deadlines and can manage multiple projects simultaneously\nConfident and Self-Assured; Isn't daunted by the task of leading projects and taking responsibility for their success\nIntuitive; you know how to access the key players and create relationships based on trust\nCurious: You strive to understand the client and the industry – The 'What, Why and How' of their strategy and tactics\nIngenuity: Finding creative ways to solve problems and create opportunities\nFearless: Acting with confidence and without fear of failure\nQuality: Taking pride in the craft and the robustness of our output\nCollaborative: Finding a rhythm in working with other people makes 'we' a lot stronger than 'me.'\nKey Duties & Responsibilities\nLeadership:\nDemonstrate a commitment to developing and embracing our core values of people, innovators and partnership.\nCollaborate to define strategic solutions based on our clients' requirements\nWork collaboratively with key team members, departments, clients, and vendors to build strong content to communicate the best EPI/CPI products, services and initiatives.\nAssist in the formulation of EPI/CPI's overall operational direction and strategy\nContribute to research activities to develop creative briefs that align creative work with the needs of EPI and our clients\nRole Accountabilities:\nProactive client account management working on various events and projects\nAttending client meetings and preparation of meetings; attendance via conference calls and in person\nParticipation in Client Events such as site inspections in Ireland and other international destinations if required\nEngage in regular communication with clients to ensure that they are exceptionally well serviced\nBudget management with scrupulous attention to detail, as explicitly required for each project as well as budget reporting and post-event analysis\nVenue management, Catering, Audio Visual including staging, lighting, entertainment, décor, Excursions and Tours, Conference & Event Materials, Signage, Exhibition management, Hotel allocations, Marketing & Promotion\nCorresponding and contracting with suppliers to include re-confirming dates, times and booking information\nAssistance to the sales team with the organisation, coordination and implementation of site inspections and Fam Trips\nFunding applications to Failte Ireland for Site Inspections and Fam Trips\nInvoice processing for suppliers and clients\nUpdating company spreadsheets for Finance Team\nPerforming other administrative tasks and duties as may be the required\nWork on-site during the event (after hours and weekends included)\nAvailability to work outside standard business hours is essential as part of this role\nExtensive understanding of the Irish business tourism product\nConstantly develop new product and service knowledge\nInternational travel may also be required\nSkills Required\nHighly organised and with a love for events.\nExcellent communication, planning and presentation skills and an ability to tailor their approach to the audience and desired outcome are prerequisites.\nThe candidate must be hard-working, committed, a team player, ability to work on their initiative.\nA genuine passion for the tourism and events industry\nHighly developed organisational skills for this very hands-on role\nStrong attention to detail & ability to multitask\nComfortable working in a fast-paced environment with multiple and strict deadlines\nExcellent financial and budget management acumen\nSelf-motivated and able to work effectively both independently and as part of a team\nExperience in contracting and negotiating, and managing suppliers to ensure optimal productivity and performance\nAwareness of international cultures and their differences/expectations\nExcellent communication and influencing skills\nFantastic relationship builder – both internally and externally\nStrong office computer skills.\nA third-level qualification is required\nFluent English is essential; additional languages would be an advantage (most specifically German)\nRight of abode in EU essential\nTop Reasons to Work for EPI\nOur people are our brand; we work for a company with a culture of developing talent and recognising employee worth.\nWorld-class learning and training opportunities and a mentor programme to meet your personal development needs.\nSeveral departments within one company offer multiple opportunities for career growth.\nA diverse and inclusive workplace with employees from all over the world and various professional backgrounds.\nGlobal opportunities with employees encouraged to work across borders and explore new destinations.\nNetwork and build relations with the most influential in the industry at national and international events.\nEarly finish on the last Friday of the month\nOur Birthday present to you is a day off\nBoost your chances of success!\nA checklist to help you land your ideal graduate role.\nMore Details\nApply by\n09.05.2025\nApply\nSave\nShare\nReport job",
    "label": 1
  },
  {
    "url": "https://gradireland.com/jobs/communications-and-engagement-intern-paid-173692",
    "description": "Graduate job\nOverview\nThis internship provides a great opportunity for students or recent graduates in the area of Climate Change, Communications or a similar discipline to gain industry experience and apply what they have learnt in college. The intern will benefit from mentoring by Codema’s experienced staff while developing practical skills and gaining professional experience in one of Ireland’s most respected and leading not-for-profit organisations within the energy sector.\nThe successful candidate will get the opportunity to work across a number of innovative projects and events, such as local community engagement on\nDecarbonising Zones\n,\nEU-funded community-focused projects\nand our annual\nDecarbonising Dublin Summit\n.\nWe are committed to leading Dublin’s low-carbon transition and we are looking for someone who is equally committed to these values and realises the key role that effective communication and local engagement plays in achieving this. Codema is a leading energy agency in Ireland, so this is a unique opportunity to gain experience and be at the forefront of driving awareness on the need to move Dublin away from fossil fuels through these various engagement activities and events.\nWhat you will do\nYou will support the delivery of core communications and engagement outputs across both our\nPublic and Stakeholder Engagement\nand\nCommunications and Marketing\nteams. The role will involve tasks and opportunities to learn in areas such as community and stakeholder engagement, event planning, and communications and marketing.\nKey tasks and responsibilities – public and stakeholder engagement\nSupport Public and Stakeholder Engagement Coordinator with key deliverables of local engagement projects:\nOn-the-ground/in-person engagement with local communities and\ndecarbonising zone\nstakeholders\nSupport in the organisation and facilitation of local engagement events and workshops\nSupport in development and design of communications and engagement materials for local engagement projects\nKey tasks and responsibilities – communications and marketing\nSupport Codema’s Communications and Marketing team with the organisation and promotion of our annual\nDecarbonising Dublin Summit\n:\nTracking and managing attendee registrations and associated queries\nEngaging with speakers and sponsors where needed\nAdministrative and logistical support (e.g. invoice tracking, data entry, contact databases, name badges, assisting with event set-up, etc.)\nCoordinating event material and associated content where needed (e.g. speakers’ bios, etc.)\nAssisting with the promotion of the event on Eventbrite, social media, newsletters, etc.\nAssisting with event outreach to key stakeholder groups\nSupporting the smooth running of the event on the day, assisting with registration desk, Q&A sessions, audience exercises, etc.\nAssisting with post-event evaluation and reporting\nSupport our Communications and Marketing team with the organisation of other events, webinars and workshops, where needed\nGeneral communication support across the Codema and\nThink Energy\ndigital marketing channels – website and social media channels and e-newsletter\nAdministrative and project management support on our\nHome Energy Saving Kit\nscheme, where needed\nWe are looking for:\nA team player who has excellent organisational and communication skills\nAn eager learner who can hit the ground running\nSomeone with a growth-mindset who will grow and learn from working on real projects\nSomeone who is not afraid to ask for help when they need it and will be supported by the Codema team at all times\nA people-person with a real ‘can-do’ attitude\nOutgoing and lots of positive energy\nMinimum requirements\nCurrently studying or recently-graduated with a Masters or Bachelor’s Degree in Climate Change/Marketing/Communications or similar discipline\nProficiency in Microsoft Word, Excel and PowerPoint\nGood communication skills with the ability to communicate effectively\nExcellent organisational and time management skills\nFluency in English is essential\nAbility to work with a team and on own initiative\nAdditional skills that would be a distinct advantage\nInterest in the energy and climate landscape in Ireland\nKnowledge and experience of website Content Management Systems (e.g. Word Press, etc.) and social media platforms\nExperience with event organisation\nKnowledge and experience of design platforms such as Canva\nExperience working with a range of stakeholders\nPlease e-mail your\nCV and a short cover letter\nto\nrecruitment@codema.ie\nby\n5pm, Friday, 9th May 2025\n.\nBoost your chances of success!\nA checklist to help you land your ideal graduate role.\nMore Details\nApply by\n09.05.2025\nApply by email\nSave\nShare\nReport job",
    "label": 1
  },
  {
    "url": "https://gradireland.com/jobs/distribution-specialist-173356",
    "description": "Graduate job\nCatalyx is seeking a Distribution Specialist to join our team and work on our customer site in Cork. As a Distribution Specialist, you will be responsible for all warehousing activities to cover goods receipt, sampling, materials handling, picking, shipping and inventory management activities. This contract is until the end of December 2025.\nWho We Are :\nCatalyx specializes in the science of operational processes. With a footprint across North America and Europe, the company carefully automates and services R&D, production, packaging, and delivery processes—globally—with a sophisticated blend of products, technologies, and lifecycle services.\nCatalyx is a trusted partner in delivering world-class lifecycle services to regulated and high-risk end markets. With a relentless commitment to innovation and excellence, we partner with life science and other highly regulated organisations, to empower them to enhance efficiency, and drive success.  As part of this commitment, we are continuously developing our on-site teams to support the advancement of customer operations.\nResponsibilities:\nPerform routine administrative and/or physical tasks involved in the shipping, receiving, storing, and distributing of our customer’s products/inventory using customer’s Oracle EBS system\nInput information regarding the movement and handling of products in a computerized inventory system and organise and maintain accurate records associated with Distribution activities.\nPerform routine transactions associated with Distribution processes through internal and external computer systems\nAdhere consistently to SOPs and cGMPs\nEscalate deviations in process or product to FSP Manager, to ensure on-time delivery of material and return of rejected or unsuitable orders\nPreparation and shipment of product from the customer’s distribution centre\nPreparation and rejection of product at the customer’s warehouse\nNotifies relevant departments as items are received, sampled, shipped or processed, as required\nPhysically examine incoming or outgoing shipments, products or samples to ensure they meet specifications and match paperwork and identify and record deviations, and escalate to the FSP Manager\nSupport batch record documentation preparation for primary and secondary packaging operations\nPerform\\support the completion of production investigations for quality & compliance management\nOperate machinery to perform, routine physical handling of items, including assembling packaging, affixing shipping labels and instructions to packaging, moving shipments\nPerform basic tasks associated with sampling of Active Pharmaceutical Ingredients (APIs), excipients and packaging components & identifies and escalates deviations to FSP Manager\nDeliver on agreed KPIs and metrics\nOther duties as requested\nRequirements:\nA relevant Level 6 qualification or specific industry experience\nMinimum of one year relevant industrial experience in a cGMP related industry\nDemonstrates familiarity with written Standard Operating Procedures (SOPs) and Master Batch Records while recognising deviations from accepted practice\nForklift licenses and used to operating heavy equipment is desirable\nExcellent written and spoken communication skills with established interpersonal skills\nProficiency in Microsoft Office applications\nDemonstrates ability to follow direction and work with only moderate supervision\nProven attention to detail\nA can-do attitude towards customer delivery and performance\nAbility to handle heights\nWhy Join Catalyx?\nAt Catalyx we understand that our people are our greatest asset. For this reason and many others, we take care of them. The team in Catalyx benefits from a Total Rewards package. This includes great personal benefits and professional growth opportunities.\nCatalyx is an Equal Opportunity Employer. We are committed to creating a diverse and inclusive workplace where all individuals are valued, respected, and supported. We do not discriminate on the basis of race, colour, religion, sex (including pregnancy, gender identity, and sexual orientation), national origin, age, disability, veteran status, genetic information, or any other characteristic protected by applicable law. We encourage applications from all qualified candidates, regardless of background, and strive to create a welcoming environment for everyone.\nAt Catalyx, we are committed to attracting the best global talent. We proudly support our international employees by offering assistance with Critical Skills Visa applications for eligible candidates.\nBoost your chances of success!\nA checklist to help you land your ideal graduate role.\nMore Details\nApply by\n09.05.2025\nApply\nSave\nShare\nReport job",
    "label": 1
  },
  {
    "url": "https://gradireland.com/jobs/packaging-technician-173374",
    "description": "Graduate job\nCatalyx is seeking a Packaging Technician to join our team and work on our customer site in Cork.\nWho We Are :\nCatalyx specializes in the science of operational processes. With a footprint across North America and Europe, the company carefully automates and services R&D, production, packaging, and delivery processes—globally—with a sophisticated blend of products, technologies, and lifecycle services.\nCatalyx is a trusted partner in delivering world-class lifecycle services to regulated and high-risk end markets. With a relentless commitment to innovation and excellence, we partner with life science and other highly regulated organisations, to empower them to enhance efficiency, and drive success.  As part of this commitment, we are continuously developing our on-site teams to support the advancement of customer operations.\nResponsibilities:\nResponsible for working on assignments that are routine in nature while recognising deviations from accepted or usual practices\nAdheres to written Standard Operating Procedures (SOPs), Master Batch Records and current Good Manufacturing Practices (cGMPs)\nWorks in conjunction with other packaging technicians under the guidance of a Team Leader/ Packaging Supervisor\nResponsible for manufacturing and packaging of our customer’s products and assists in the inspection of our customer’s products, Clinical Trial Material and components\nSets up and operates Packaging line equipment, including Labellers, Cartoners and Printers\nComplies with all safety-related procedures and practices, individually and in the area\nSets up check-weighing of multi-unit cartons\nPerforms ERP/MES transactions\nComplies with well-defined instructions on routine work and detailed instructions on new assignments\nReports variance or deviation from standard procedures to FSP Manager\nTakes variant action with approval of Supervisor or FSP Manager\nDeliver on agreed KPIs and metrics\nOther duties as requested\nRequirements:\nGMP experience and previous packaging experience\nA relevant Level 6 qualification\nDemonstrate familiarity with written Standard Operating Procedures (SOPs) and Master Batch Records\nExcellent written and spoken communication skills with established interpersonal skills\nProficiency in Microsoft Office applications\nDemonstrates ability to follow direction and work with only moderate supervision\nProven attention to detail\nA can-do attitude towards customer delivery and performance\nWhy Join Catalyx?\nAt Catalyx we understand that our people are our greatest asset. For this reason and many others, we take care of them. The team in Catalyx benefits from a Total Rewards package. This includes great personal benefits and professional growth opportunities.\nCatalyx is an Equal Opportunity Employer. We are committed to creating a diverse and inclusive workplace where all individuals are valued, respected, and supported. We do not discriminate on the basis of race, colour, religion, sex (including pregnancy, gender identity, and sexual orientation), national origin, age, disability, veteran status, genetic information, or any other characteristic protected by applicable law. We encourage applications from all qualified candidates, regardless of background, and strive to create a welcoming environment for everyone.\nAt Catalyx, we are committed to attracting the best global talent. We proudly support our international employees by offering assistance with Critical Skills Visa applications for eligible candidates.\nBoost your chances of success!\nA checklist to help you land your ideal graduate role.\nMore Details\nApply by\n09.05.2025\nApply\nSave\nShare\nReport job",
    "label": 1
  },
  {
    "url": "https://gradireland.com/jobs/rdqc-technician-173324",
    "description": "Graduate job\nEmeri Nutrition - R&D/QC Technician\nEmeri Nutrition Co Limited is looking to employ an R&D/QC Technician to work closely with our management teams in Ireland and in China. The primary focus of the position is to help develop new products, maintain Quality Control & HACCP procedures, and assist with new product registration.\nSome of the key duties will include:\nAssisting with the management of our Food Safety & Quality Systems\nCooperation with colleagues in China on R&D and Quality issues\nAssisting with the preparation of documentation for product registration in China and translation of technical documents where required\nQualifications / Experience:\nDegree in Food Science, Nutritional Science or similar is desired\nFluent English & Mandarin - written and spoken - essential\nKnowledge of HACCP and Food Safety & Quality Management Systems\nKey behaviours / Competencies:\nAbility to work on own initiative, be self-motivated\nBuild a good working relationship with other departments within the company in Ireland & China\nExcellent verbal and communication skills\nExcellent attention to detail skills in relation to quality and documentation\nFlexible to the needs of the business\nOther Details:\nThe business is currently in the process of obtaining product registrations in China so the factory is not yet operational. This is one of the first technical hires for the business in Ireland and is a good opportunity for the right person to gain experience and develop a career in the nutrition industry. Initially the position can be hybrid-remote but once manufacturing begins the person will be required to be on site full time. Factory start up is planned for early 2026.\nThe initial contract will be for a fixed period of 6 months. A subsequent permanent contract may be available at the discretion of the company.\nAll applicants must hold a valid work visa for Ireland.\nBoost your chances of success!\nA checklist to help you land your ideal graduate role.\nMore Details\nApply by\n09.05.2025\nApply by email\nSave\nShare\nReport job",
    "label": 1
  },
  {
    "url": "https://gradireland.com/jobs/measurement-psychologist-analytics-specialist-161572",
    "description": "Graduate job\nYOUR MISSION\nAre you passionate about leveraging data and psychometrics to enhance workplace experiences? As an Analytical Specialist at Welliba, you’ll be at the forefront of psychometric research and data analysis, working alongside a diverse team focused on the intersection of psychology, technology, and product development. This role provides an excellent opportunity to apply and expand your skills in psychometrics, data analysis, validation studies, and evidence-based insights—all to create products that empower organizations and drive impactful employee experiences globally.\nWHAT YOU'LL DO\nDevelop and validate psychometric tools that capture key aspects of employee experience and well-being, ensuring they meet high standards of reliability and validity.\nConduct data analysis and run validation studies to support our psychometric solutions, providing actionable insights and recommendations based on empirical evidence.\nTranslate analytical findings into practical, data-driven insights for our clients, helping them understand and implement solutions that optimize employee experience.\nCollaborate with product and tech teams to integrate psychometric tools into our platforms, ensuring smooth functionality and user-friendly data presentation.\nWork closely with stakeholders to understand their needs, tailoring data insights to align with organizational goals and client expectations.\nPresent research findings at international scientific conferences and publish articles in peer-reviewed journals to contribute to the scientific community and enhance our organization's reputation.\nWHO YOU ARE\nYou hold, or are close to completing, a Bachelor’s or Master’s degree in psychology, industrial-organizational psychology, quantitative psychology, or a related field.\nYou have a strong interest in psychometrics, statistical analysis, and data-driven problem-solving, with a passion for turning complex data into clear, actionable insights.\nYou possess a high level of precision in your work and an understanding of psychometric best practices, statistical testing, and validation methodologies.\nYou have experience with tools like R or Python, helping you effectively analyze complex data.\nYou have experience with LLMs, have tried using different types of AI services and are eager to learn more about leveraging latest technologies\nYou’re familiar with data visualization techniques to make insights easily understandable for clients.\nYou’re fluent in English, and an additional European language is a plus.\nYou’re based in Ireland and authorized to work there.\nWHAT’S IN IT FOR YOU?\nA unique role at the intersection of psychology, data science, and technology, with ample learning opportunities in psychometric analysis.\nCompetitive salary and flexible working conditions.\nA flat organizational structure promoting quick decision-making and innovative contributions.\nA supportive, collaborative team focused on continuous growth and shared success.\nYOUR APPLICATION\nSend us your CV and a Cover Letter (\njobs@welliba.com\n).\nWe’d love to hear about your experience and aspirations.\nBoost your chances of success!\nA checklist to help you land your ideal graduate role.\nMore Details\nApply by\n12.05.2025\nLocations\nDublin\nApply\nSave\nShare\nReport job",
    "label": 1
  }
]